+posts/lang/c-c++/structures.org
#+INCLUDE: ../../../+layouts/header.org
#+TITLE: Structures And Pointers

* Beginners tutorial                                      :TOC_4_gh:noexport:
- [[#basics-of-structures][Basics of structures]]
  - [[#definition][Definition]]
    - [[#but-what-do-we-mean-by-that][But what do we mean by that?]]
  - [[#syntax][Syntax]]
  - [[#properties-of-a-structure][Properties of a structure]]
  - [[#structure-variables][Structure variables]]
- [[#a-basic-students-record-program][A basic Students Record program]]
  - [[#using-standard-approach][using standard approach]]
  - [[#using-structural-approach][using structural approach]]
  - [[#using-structure-with-typedef][using structure with ’typedef’]]
    - [[#syntax-1][Syntax:]]
    - [[#example][Example:]]
- [[#thank-you-][Thank You, 😍]]

* Basics of structures

** Definition
A structure simply is a collection of finite set of similar (heterogeneous)
collection of data elements under a single name.

*** But what do we mean by that?
Consider a scenario where we want to maintain a College record of a student.
Now, let’s try to visualize the various variables we are going to deal with:

- student-Name
- student-Email
- student-Branch
- student-Mobile
- student-Year
- student-Age
- student-Gender
- student-DOB
- student-RollNo
- student-Course
- student-Father-Name
- student-Mother–Name
- student-Subjects
- student-Marks
- student-Percentage
- student-Curr-Semester
- student-Aggregate-Marks

and the list goes on…

_*Phew!!! So much clutter in all these variables, very hard to keep track of
each one of them individually.*_
    
The best approach to follow in a programming environment is *“Divide
n’Conquer”*. Instead of dealing with all these variables at once, let’s try to
*divide them into groups*:
    
    |-----------+--------------------------|
    | _GROUP - A_ | *student-Personal-Details* |
    |-----------+--------------------------|
    |           | - name                   |
    |           | - age                    |
    |           | - gender                 |
    |           | - DOB                    |
    |           | - email                  |
    |           | - mobile                 |
    |           | - father-Name            |
    |           | - mother-name            |
    |-----------+--------------------------|

    |-----------+-------------------------|
    | _GROUP - B_ | *student-College-Details* |
    |-----------+-------------------------|
    |           | - rollNo                |
    |           | - year                  |
    |           | - branch                |
    |           | - course                |
    |           | - semester              |
    |-----------+-------------------------|

    |-----------+--------------------------|
    | _GROUP - C_ | *student-Academic-Details* |
    |-----------+--------------------------|
    |           | - subjects               |
    |           | - marks                  |
    |           | - percentage             |
    |           | - aggregate              |
    |-----------+--------------------------|

    Now it’s pretty easy to keep track of each of the variables with the help of their
    corresponding groups. Isn’t it? That’s exactly the idea behind the concepts of structure.

** Syntax
In C Language, The syntax of writing a block of structure is follows:
   
#+BEGIN_SRC C
struct <structure_name> {
  data_element#1;
  data_element#2;
  data_element#3;
  .
  .
  .
  data_element#n;
  };
#+END_SRC

Now, Let’s try to construct our very own structure in C Language for the
following sample:

|-----------+--------------------------|
| _GROUP - A_ | *student-Personal-Details* |
|-----------+--------------------------|
|           | - name                   |
|           | - age                    |
|           | - gender                 |
|           | - DOB                    |
|           | - email                  |
|           | - mobile                 |
|           | - father-Name            |
|           | - mother-name            |
|-----------+--------------------------|

becomes:

#+BEGIN_SRC C
struct student_Personal_Details {
  char *name;
  int age;
  char gender;
  int DOB;
  char *email;
  int mobile;
  char father_Name;
  char mother_Name;
};
#+END_SRC
     
