lang/c/structures.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-03-12 Mon 00:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Structures And Pointers</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Shubham Mahajan" />
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css" />
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css" />
</head>
<body>
<div id="content">
<h1 class="title">Structures And Pointers</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org955613e">1. <span class="todo TODO">TODO</span> Basics of structures</a>
<ul>
<li><a href="#org5562075">1.1. <span class="done DONE">DONE</span> Definition</a></li>
</ul>
</li>
<li><a href="#orgd2914c1">2. Basics of structures</a>
<ul>
<li><a href="#org69d000e">2.1. Definition</a></li>
</ul>
</li>
<li><a href="#orgb953e2c">3. Basics of structures</a>
<ul>
<li><a href="#orgec02877">3.1. <span class="done DONE">DONE</span> Definition</a>
<ul>
<li><a href="#orgf083371">3.1.1. But what do we mean by that?</a></li>
</ul>
</li>
<li><a href="#org0625945">3.2. Syntax</a></li>
<li><a href="#orge561c93">3.3. Properties of a structure</a></li>
<li><a href="#org9ece7e8">3.4. Structure variables</a></li>
</ul>
</li>
<li><a href="#org21d6e11">4. A basic Students Record program</a>
<ul>
<li><a href="#orgbdb38ef">4.1. using standard approach</a></li>
<li><a href="#org3c127ae">4.2. using structural approach</a></li>
<li><a href="#org9f50d6c">4.3. using structure with ’typedef’</a>
<ul>
<li><a href="#orgf4e31d9">4.3.1. Syntax:</a></li>
<li><a href="#orgc8e0249">4.3.2. Example:</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org5778747">5. Thank You!</a></li>
</ul>
</div>
</div>
<p>
&lt;&lt;&lt;&lt;&lt;&lt;&lt; HEAD
<code>=====</code>
</p>
<p>
&gt;&gt;&gt;&gt;&gt;&gt;&gt; 089941baa3b144514581895c2c4fa2031cc34755
</p>

<div id="outline-container-org955613e" class="outline-2">
<h2 id="org955613e"><span class="section-number-2">1</span> <span class="todo TODO">TODO</span> Basics of structures</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org5562075" class="outline-3">
<h3 id="org5562075"><span class="section-number-3">1.1</span> <span class="done DONE">DONE</span> Definition</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<code>=====</code>
</p>
</div>
</div>
</div>
<div id="outline-container-orgd2914c1" class="outline-2">
<h2 id="orgd2914c1"><span class="section-number-2">2</span> Basics of structures</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org69d000e" class="outline-3">
<h3 id="org69d000e"><span class="section-number-3">2.1</span> Definition</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<code>=====</code>
</p>
</div>
</div>
</div>
<div id="outline-container-orgb953e2c" class="outline-2">
<h2 id="orgb953e2c"><span class="section-number-2">3</span> Basics of structures</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgec02877" class="outline-3">
<h3 id="orgec02877"><span class="section-number-3">3.1</span> <span class="done DONE">DONE</span> Definition</h3>
<div class="outline-text-3" id="text-3-1">
<p>
&gt;&gt;&gt;&gt;&gt;&gt;&gt; 56fa0856f7ac8a3f6ccbb031f887df86ce329ca7
&gt;&gt;&gt;&gt;&gt;&gt;&gt; 089941baa3b144514581895c2c4fa2031cc34755
</p>

<p>
A structure simply is a collection of finite set of similar (heterogeneous)
collection of data elements under a single name.
</p>
</div>

<div id="outline-container-orgf083371" class="outline-4">
<h4 id="orgf083371"><span class="section-number-4">3.1.1</span> But what do we mean by that?</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
Consider a scenario where we want to maintain a College record of a student.
Now, let’s try to visualize the various variables we are going to deal with:
</p>

<ul class="org-ul">
<li>student-Name</li>
<li>student-Email</li>
<li>student-Branch</li>
<li>student-Mobile</li>
<li>student-Year</li>
<li>student-Age</li>
<li>student-Gender</li>
<li>student-DOB</li>
<li>student-RollNo</li>
<li>student-Course</li>
<li>student-Father-Name</li>
<li>student-Mother–Name</li>
<li>student-Subjects</li>
<li>student-Marks</li>
<li>student-Percentage</li>
<li>student-Curr-Semester</li>
<li>student-Aggregate-Marks</li>
</ul>

<p>
and the list goes on…
</p>

<p>
<span class="underline"><b>Phew!!! So much clutter in all these variables, very hard to keep track of
each one of them individually.</b></span>
</p>

<p>
The best approach to follow in a programming environment is <b>“Divide
n’Conquer”</b>. Instead of dealing with all these variables at once, let’s try to
<b>divide them into groups</b>:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><span class="underline">GROUP - A</span></th>
<th scope="col" class="org-left"><b>student-Personal-Details</b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">- name</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">- age</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">- gender</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">- DOB</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">- email</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">- mobile</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">- father-Name</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">- mother-name</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><span class="underline">GROUP - B</span></th>
<th scope="col" class="org-left"><b>student-College-Details</b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">- rollNo</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">- year</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">- branch</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">- course</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">- semester</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><span class="underline">GROUP - C</span></th>
<th scope="col" class="org-left"><b>student-Academic-Details</b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">- subjects</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">- marks</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">- percentage</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">- aggregate</td>
</tr>
</tbody>
</table>

<p>
Now it’s pretty easy to keep track of each of the variables with the help of their
corresponding groups. Isn’t it? That’s exactly the idea behind the concepts of structure.
</p>
</div>
</div>
</div>

<div id="outline-container-org0625945" class="outline-3">
<h3 id="org0625945"><span class="section-number-3">3.2</span> Syntax</h3>
<div class="outline-text-3" id="text-3-2">
<p>
In C Language, The syntax of writing a block of structure is follows:
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #4f97d7; font-weight: bold;">struct</span> &lt;structure_name&gt; <span style="color: #4f97d7;">{</span>
  data_element#<span style="color: #a45bad;">1</span>;
  data_element#<span style="color: #a45bad;">2</span>;
  data_element#<span style="color: #a45bad;">3</span>;
  .
  .
  .
  data_element#n;
  <span style="color: #4f97d7;">}</span>;
</pre>
</div>

<p>
Now, Let’s try to construct our very own structure in C Language for the
following sample:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><span class="underline">GROUP - A</span></th>
<th scope="col" class="org-left"><b>student-Personal-Details</b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">- name</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">- age</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">- gender</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">- DOB</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">- email</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">- mobile</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">- father-Name</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">- mother-name</td>
</tr>
</tbody>
</table>

<p>
becomes:
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #4f97d7; font-weight: bold;">struct</span> <span style="color: #ce537a; font-weight: bold;">student_Personal_Details</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #ce537a; font-weight: bold;">char</span> *<span style="color: #7590db;">name</span>;
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">age</span>;
  <span style="color: #ce537a; font-weight: bold;">char</span> <span style="color: #7590db;">gender</span>;
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">DOB</span>;
  <span style="color: #ce537a; font-weight: bold;">char</span> *<span style="color: #7590db;">email</span>;
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">mobile</span>;
  <span style="color: #ce537a; font-weight: bold;">char</span> <span style="color: #7590db;">father_Name</span>;
  <span style="color: #ce537a; font-weight: bold;">char</span> <span style="color: #7590db;">mother_Name</span>;
<span style="color: #4f97d7;">}</span>;
</pre>
</div>
</div>
</div>
