+posts/lang/c-c++/structures.org
** Properties of a structure
- Structure in itself is user-defined data-type.
- The ~<structure_name>~ is a pointer, pointing the first data-element of
  it’s collection.
- All the data-elements of a structure are stored in a contiguous memory fashion
  i.e in above example, if ~student_Personal_Details~ is a structure name then it would
  point/store the address of it’s first element: ~char *name;~. We’ll later
  explore how it works internally.
- A structure can hold as many data-elements as required and that too
  heterogeneous elements (different data-type).
- Structures are defined globally.
- All data-elements of a structure are private/only known to structure and
  it’s variables. They can’t be directly accessed outside the structure.
- The data-elements in a structure are called ~members~ of that structure.
- Structures and it’s members are accessed via their ~structure variables~ and the
  ~DOT (.)~ operator i.e.

** Structure variables
As we discussed earlier, ~structure~ itself is a user-defined data-type. So,
every data-type must’ve a variable-name so as to use it. In case of
~structures~, they are declared as follows:

#+BEGIN_SRC C
struct <structure_name> <structure_variable>; 
#+END_SRC

For example:

#+BEGIN_SRC C
struct student_Personal_Details std1;
#+END_SRC

So, ~std1~ is a variable name of ~struct student_Personal_Details~ data-type.

* A basic Students Record program
Now, Let’s try to develop a program where our goal is to get the following data
of a student from the user:

- Roll No
- Name
- Email
- Branch

** using standard approach

Writing ’Students Record’ program using only single main/normal function.

#+begin_src C
#include <stdio.h>
#include <stdlib.h>

int main (void) {
  int rollNo;
  char *name;
  char *email;
  char *branch;

  printf("Roll No - ");
  scanf(”%d“, &rollNo);

  printf("Name - ");
  fgets(&name, 25, stdin);

  printf("Branch - ");
  fgets(&branch, 10, stdin);

  printf("Email - ");
  fgets(&email, 50, stdin);

  return EXIT_SUCCESS;
}
#+end_src

** using structural approach

Same program, but instead using structure.

#+begin_src C
  #include <stdio.h>
  #include <stdlib.h>

  struct student_Personal_Details {
    int rollNo;
    char *name;
    char *email;
    char *branch;
  };

  struct student_Personal_Details std1;

  void populate_Structure(void) {
    printf("Roll No. - ");
    scanf("%d", &std1.rollNo);

    printf("Name - ");
    fgets(std1.name, 25, stdin);

    printf("Branch - ");
    fgets(std1.branch, 10, stdin);

    printf("Email - ");
    fgets(std1.email, 50, stdin);
  }

  int main(void) {
    populate_Structure();

    return EXIT_SUCCESS;
  }
#+end_src
 
** using structure with ’typedef’
The ~typedef~ /stands/ for ~type definition~. So using ~typedef~, we can give a
new alias/name to already existing data-type i.e. same as one person can have
two names.

*** Syntax:

#+BEGIN_SRC C
typedef <datatype> <alias/new_name>;
#+END_SRC

