lang/c/structures.html

<div id="outline-container-orge561c93" class="outline-3">
<h3 id="orge561c93"><span class="section-number-3">3.3</span> Properties of a structure</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li>Structure in itself is user-defined data-type.</li>
<li>The <code>&lt;structure_name&gt;</code> is a pointer, pointing the first data-element of
it’s collection.</li>
<li>All the data-elements of a structure are stored in a contiguous memory fashion
i.e in above example, if <code>student_Personal_Details</code> is a structure name then it would
point/store the address of it’s first element: <code>char *name;</code>. We’ll later
explore how it works internally.</li>
<li>A structure can hold as many data-elements as required and that too
heterogeneous elements (different data-type).</li>
<li>Structures are defined globally.</li>
<li>All data-elements of a structure are private/only known to structure and
it’s variables. They can’t be directly accessed outside the structure.</li>
<li>The data-elements in a structure are called <code>members</code> of that structure.</li>
<li>Structures and it’s members are accessed via their <code>structure variables</code> and the
<code>DOT (.)</code> operator i.e.</li>
</ul>
</div>
</div>

<div id="outline-container-org9ece7e8" class="outline-3">
<h3 id="org9ece7e8"><span class="section-number-3">3.4</span> Structure variables</h3>
<div class="outline-text-3" id="text-3-4">
<p>
As we discussed earlier, <code>structure</code> itself is a user-defined data-type. So,
every data-type must’ve a variable-name so as to use it. In case of
<code>structures</code>, they are declared as follows:
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #4f97d7; font-weight: bold;">struct</span> &lt;structure_name&gt; &lt;structure_variable&gt;; 
</pre>
</div>

<p>
For example:
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #4f97d7; font-weight: bold;">struct</span> <span style="color: #ce537a; font-weight: bold;">student_Personal_Details</span> <span style="color: #7590db;">std1</span>;
</pre>
</div>

<p>
So, <code>std1</code> is a variable name of <code>struct student_Personal_Details</code> data-type.
</p>
</div>
</div>
</div>

<div id="outline-container-org21d6e11" class="outline-2">
<h2 id="org21d6e11"><span class="section-number-2">4</span> A basic Students Record program</h2>
<div class="outline-text-2" id="text-4">
<p>
Now, Let’s try to develop a program where our goal is to get the following data
of a student from the user:
</p>

<ul class="org-ul">
<li>Roll No</li>
<li>Name</li>
<li>Email</li>
<li>Branch</li>
</ul>
</div>

<div id="outline-container-orgbdb38ef" class="outline-3">
<h3 id="orgbdb38ef"><span class="section-number-3">4.1</span> using standard approach</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Writing ’Students Record’ program using only single main/normal function.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #bc6ec5;">#include</span> <span style="color: #4f97d7;">&lt;</span><span style="color: #2d9574;">stdio.h</span><span style="color: #4f97d7;">&gt;</span>
<span style="color: #bc6ec5;">#include</span> <span style="color: #4f97d7;">&lt;</span><span style="color: #2d9574;">stdlib.h</span><span style="color: #4f97d7;">&gt;</span>

<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span> <span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">void</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">rollNo</span>;
  <span style="color: #ce537a; font-weight: bold;">char</span> *<span style="color: #7590db;">name</span>;
  <span style="color: #ce537a; font-weight: bold;">char</span> *<span style="color: #7590db;">email</span>;
  <span style="color: #ce537a; font-weight: bold;">char</span> *<span style="color: #7590db;">branch</span>;

  printf<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"Roll No - "</span><span style="color: #bc6ec5;">)</span>;
  scanf<span style="color: #bc6ec5;">(</span>&#8221;%d&#8220;, &amp;rollNo<span style="color: #bc6ec5;">)</span>;

  printf<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"Name - "</span><span style="color: #bc6ec5;">)</span>;
  fgets<span style="color: #bc6ec5;">(</span>&amp;name, <span style="color: #a45bad;">25</span>, stdin<span style="color: #bc6ec5;">)</span>;

  printf<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"Branch - "</span><span style="color: #bc6ec5;">)</span>;
  fgets<span style="color: #bc6ec5;">(</span>&amp;branch, <span style="color: #a45bad;">10</span>, stdin<span style="color: #bc6ec5;">)</span>;

  printf<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"Email - "</span><span style="color: #bc6ec5;">)</span>;
  fgets<span style="color: #bc6ec5;">(</span>&amp;email, <span style="color: #a45bad;">50</span>, stdin<span style="color: #bc6ec5;">)</span>;

  <span style="color: #4f97d7; font-weight: bold;">return</span> EXIT_SUCCESS;
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<p>
&lt;&lt;&lt;&lt;&lt;&lt;&lt; HEAD
<code>=====</code>
&lt;&lt;&lt;&lt;&lt;&lt;&lt; HEAD
</p>
<p>
<code>=====</code>
&gt;&gt;&gt;&gt;&gt;&gt;&gt; 56fa0856f7ac8a3f6ccbb031f887df86ce329ca7
&gt;&gt;&gt;&gt;&gt;&gt;&gt; 089941baa3b144514581895c2c4fa2031cc34755
</p>
</div>
</div>
<div id="outline-container-org3c127ae" class="outline-3">
<h3 id="org3c127ae"><span class="section-number-3">4.2</span> using structural approach</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Same program, but instead using structure.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #bc6ec5;">#include</span> <span style="color: #4f97d7;">&lt;</span><span style="color: #2d9574;">stdio.h</span><span style="color: #4f97d7;">&gt;</span>
<span style="color: #bc6ec5;">#include</span> <span style="color: #4f97d7;">&lt;</span><span style="color: #2d9574;">stdlib.h</span><span style="color: #4f97d7;">&gt;</span>

<span style="color: #4f97d7; font-weight: bold;">struct</span> <span style="color: #ce537a; font-weight: bold;">student_Personal_Details</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">rollNo</span>;
  <span style="color: #ce537a; font-weight: bold;">char</span> *<span style="color: #7590db;">name</span>;
  <span style="color: #ce537a; font-weight: bold;">char</span> *<span style="color: #7590db;">email</span>;
  <span style="color: #ce537a; font-weight: bold;">char</span> *<span style="color: #7590db;">branch</span>;
<span style="color: #4f97d7;">}</span>;

<span style="color: #4f97d7; font-weight: bold;">struct</span> <span style="color: #ce537a; font-weight: bold;">student_Personal_Details</span> <span style="color: #7590db;">std1</span>;

<span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">populate_Structure</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">void</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
  printf<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"Roll No. - "</span><span style="color: #bc6ec5;">)</span>;
  scanf<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"%d"</span>, &amp;std1.rollNo<span style="color: #bc6ec5;">)</span>;

  printf<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"Name - "</span><span style="color: #bc6ec5;">)</span>;
  fgets<span style="color: #bc6ec5;">(</span>std1.name, <span style="color: #a45bad;">25</span>, stdin<span style="color: #bc6ec5;">)</span>;

  printf<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"Branch - "</span><span style="color: #bc6ec5;">)</span>;
  fgets<span style="color: #bc6ec5;">(</span>std1.branch, <span style="color: #a45bad;">10</span>, stdin<span style="color: #bc6ec5;">)</span>;

  printf<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"Email - "</span><span style="color: #bc6ec5;">)</span>;
  fgets<span style="color: #bc6ec5;">(</span>std1.email, <span style="color: #a45bad;">50</span>, stdin<span style="color: #bc6ec5;">)</span>;
<span style="color: #4f97d7;">}</span>

<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">void</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
  populate_Structure<span style="color: #bc6ec5;">()</span>;

  <span style="color: #4f97d7; font-weight: bold;">return</span> EXIT_SUCCESS;
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9f50d6c" class="outline-3">
<h3 id="org9f50d6c"><span class="section-number-3">4.3</span> using structure with ’typedef’</h3>
<div class="outline-text-3" id="text-4-3">
<p>
&lt;&lt;&lt;&lt;&lt;&lt;&lt; HEAD
</p>

<p>
<code>=====</code>
&gt;&gt;&gt;&gt;&gt;&gt;&gt; 089941baa3b144514581895c2c4fa2031cc34755
The <code>typedef</code> <i>stands</i> for <code>type definition</code>. So using <code>typedef</code>, we can give a
new alias/name to already existing data-type i.e. same as one person can have
two names.
</p>
</div>

<div id="outline-container-orgf4e31d9" class="outline-4">
<h4 id="orgf4e31d9"><span class="section-number-4">4.3.1</span> Syntax:</h4>
<div class="outline-text-4" id="text-4-3-1">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #4f97d7; font-weight: bold;">typedef</span> &lt;datatype&gt; &lt;alias/new_name&gt;;
</pre>
</div>
</div>
</div>
